In [5]:
# !pip install mysql-connector-python

In [4]:
import mysql.connector as con

In [12]:
connection=con.connect(
    host='localhost',
    user='root',
    password='123456'
)
print('Connection Ok..')

Connection Ok..

In [13]:
cr=connection.cursor()

In [14]:
cr.execute('show databases;')
for i in cr.fetchall():
    print(i)

('batch4pm',)
('homerevison',)
('homework',)
('information_schema',)
('mayank',)
('mysql',)
('performance_schema',)
('sales',)

In [20]:
cr.execute('use batch4pm;')
for i in cr.fetchall():
    print(i)

In [22]:
cr.execute('show tables;')
for i in cr.fetchall():
    print(i)

('cloths',)
('colour',)
('department',)
('emp',)
('emp1',)
('employee',)
('employee11',)
('employee12',)
('employee2',)
('person2',)
('project',)
('project2',)
('project3',)
('student',)

In [25]:
cr.execute('Select * from employee;')
for i in cr.fetchall():
    print(i)

(101, 'Amit Sharma', 1, None, Decimal('60000.00'), datetime.date(2022, 1, 15))
(102, 'Bhavna Mehra', 2, 101, Decimal('55000.00'), datetime.date(2022, 3, 18))
(103, 'Chirag Verma', 3, 101, Decimal('65000.00'), datetime.date(2022, 5, 22))
(104, 'Deepa Rawat', 3, 103, Decimal('70000.00'), datetime.date(2022, 7, 25))
(105, 'Eshan Singh', 4, 101, Decimal('48000.00'), datetime.date(2022, 9, 29))
(106, 'Farah Khan', 5, 101, Decimal('52000.00'), datetime.date(2022, 11, 30))
(107, 'Gaurav Patel', 1, 101, Decimal('58000.00'), datetime.date(2023, 1, 10))
(108, 'Heena Das', 2, 102, Decimal('61000.00'), datetime.date(2023, 2, 15))
(109, 'Imran Ali', 3, 103, Decimal('54000.00'), datetime.date(2023, 3, 21))
(110, 'Jyoti Rana', 4, 105, Decimal('47000.00'), datetime.date(2023, 4, 18))
(111, 'Kunal Joshi', 5, 106, Decimal('51000.00'), datetime.date(2023, 5, 20))
(112, 'Lata Sharma', None, None, Decimal('40000.00'), datetime.date(2023, 6, 12))
(113, 'Manoj Bhat', 1, 107, Decimal('63000.00'), datetime.date(2023, 7, 25))
(114, 'Nisha Jain', 2, 108, Decimal('57000.00'), datetime.date(2023, 8, 30))
(115, 'Omkar Rao', 3, 104, Decimal('75000.00'), datetime.date(2023, 9, 5))
(116, 'Pooja Sen', 4, 110, Decimal('49000.00'), datetime.date(2023, 10, 10))
(117, 'Qasim Sheikh', None, None, Decimal('42000.00'), datetime.date(2023, 11, 11))
(118, 'Ritika Ghosh', 5, 106, Decimal('53000.00'), datetime.date(2023, 12, 1))
(119, 'Sanjay Sinha', 1, 107, Decimal('62000.00'), datetime.date(2024, 1, 1))
(120, 'Tina Kaur', 2, 102, Decimal('58000.00'), datetime.date(2024, 2, 12))
(121, 'Uday Bhatt', 3, None, Decimal('67000.00'), datetime.date(2024, 3, 15))

In [29]:
import pandas as pd
connection=con.connect(
    host='localhost',
    user='root',
    password='123456',
    database='batch4pm'
)
print('Connection Ok..')

Connection Ok..

In [34]:
pd.read_sql_query("show databases;",connection)

C:\Users\user\AppData\Local\Temp\ipykernel_23644\6314885.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("show databases;",connection)

             Database
0            batch4pm
1         homerevison
2            homework
3  information_schema
4              mayank
5               mysql
6  performance_schema
7               sales

In [32]:
pd.read_sql_query("show tables;",connection)

C:\Users\user\AppData\Local\Temp\ipykernel_23644\3693260519.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("show tables;",connection)

   Tables_in_batch4pm
0              cloths
1              colour
2          department
3                 emp
4                emp1
5            employee
6          employee11
7          employee12
8           employee2
9             person2
10            project
11           project2
12           project3
13            student

In [33]:
pd.read_sql_query("Select * from employee;",connection)

C:\Users\user\AppData\Local\Temp\ipykernel_23644\92944454.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("Select * from employee;",connection)

    EmployeeID          Name  DepartmentID  ManagerID   Salary    JoinDate
0          101   Amit Sharma           1.0        NaN  60000.0  2022-01-15
1          102  Bhavna Mehra           2.0      101.0  55000.0  2022-03-18
2          103  Chirag Verma           3.0      101.0  65000.0  2022-05-22
3          104   Deepa Rawat           3.0      103.0  70000.0  2022-07-25
4          105   Eshan Singh           4.0      101.0  48000.0  2022-09-29
5          106    Farah Khan           5.0      101.0  52000.0  2022-11-30
6          107  Gaurav Patel           1.0      101.0  58000.0  2023-01-10
7          108     Heena Das           2.0      102.0  61000.0  2023-02-15
8          109     Imran Ali           3.0      103.0  54000.0  2023-03-21
9          110    Jyoti Rana           4.0      105.0  47000.0  2023-04-18
10         111   Kunal Joshi           5.0      106.0  51000.0  2023-05-20
11         112   Lata Sharma           NaN        NaN  40000.0  2023-06-12
12         113    Manoj Bhat           1.0      107.0  63000.0  2023-07-25
13         114    Nisha Jain           2.0      108.0  57000.0  2023-08-30
14         115     Omkar Rao           3.0      104.0  75000.0  2023-09-05
15         116     Pooja Sen           4.0      110.0  49000.0  2023-10-10
16         117  Qasim Sheikh           NaN        NaN  42000.0  2023-11-11
17         118  Ritika Ghosh           5.0      106.0  53000.0  2023-12-01
18         119  Sanjay Sinha           1.0      107.0  62000.0  2024-01-01
19         120     Tina Kaur           2.0      102.0  58000.0  2024-02-12
20         121    Uday Bhatt           3.0        NaN  67000.0  2024-03-15

In [35]:
pd.read_sql_query("Select * from department;",connection)

C:\Users\user\AppData\Local\Temp\ipykernel_23644\1455009708.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("Select * from department;",connection)

   DepartmentID DepartmentName   Location
0             1             HR      Delhi
1             2        Finance     Mumbai
2             3             IT  Bangalore
3             4          Sales    Chennai
4             5        Support  Hyderabad

In [37]:
query='select name,count(*) from employee as e inner join department d on e.DepartmentID=d.DepartmentID group by name;'
pd.read_sql_query(query,connection)

C:\Users\user\AppData\Local\Temp\ipykernel_23644\614723153.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query,connection)

            name  count(*)
0    Amit Sharma         1
1   Gaurav Patel         1
2     Manoj Bhat         1
3   Sanjay Sinha         1
4   Bhavna Mehra         1
5      Heena Das         1
6     Nisha Jain         1
7      Tina Kaur         1
8   Chirag Verma         1
9    Deepa Rawat         1
10     Imran Ali         1
11     Omkar Rao         1
12    Uday Bhatt         1
13   Eshan Singh         1
14    Jyoti Rana         1
15     Pooja Sen         1
16    Farah Khan         1
17   Kunal Joshi         1
18  Ritika Ghosh         1

In [4]:
#pip install SQLAlchemy

In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [6]:
engine=create_engine('mysql+mysqlconnector://root:123456@localhost/batch4pm')

In [7]:
query='select * from employee2;'
pd.read_sql(query,engine)

   e_id  e_name
0   101    Mr A
1   104    Mr b
2   105  mayank
3   106    Mr c
4   107    Mr d

In [8]:
pip install pymysql

Collecting pymysql
  Downloading pymysql-1.1.2-py3-none-any.whl.metadata (4.3 kB)
Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2
Note: you may need to restart the kernel to use updated packages.

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000022C8E22BD10>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pymysql/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000022C8E0CFBC0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pymysql/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x0000022C8E29C230>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/pymysql/

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import pymysql as py

In [12]:
connection =py.connect(
    host='localhost',
    port=3306,
    user='root',
    password='123456',
    database='batch4pm'
)
print('Connection OK...')

Connection OK...

In [17]:
import pandas as pd 
pd.read_sql_query("select * from employee;",connection)

C:\Users\user\AppData\Local\Temp\ipykernel_24216\793095512.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("select * from employee;",connection)

    EmployeeID          Name  DepartmentID  ManagerID   Salary    JoinDate
0          101   Amit Sharma           1.0        NaN  60000.0  2022-01-15
1          102  Bhavna Mehra           2.0      101.0  55000.0  2022-03-18
2          103  Chirag Verma           3.0      101.0  65000.0  2022-05-22
3          104   Deepa Rawat           3.0      103.0  70000.0  2022-07-25
4          105   Eshan Singh           4.0      101.0  48000.0  2022-09-29
5          106    Farah Khan           5.0      101.0  52000.0  2022-11-30
6          107  Gaurav Patel           1.0      101.0  58000.0  2023-01-10
7          108     Heena Das           2.0      102.0  61000.0  2023-02-15
8          109     Imran Ali           3.0      103.0  54000.0  2023-03-21
9          110    Jyoti Rana           4.0      105.0  47000.0  2023-04-18
10         111   Kunal Joshi           5.0      106.0  51000.0  2023-05-20
11         112   Lata Sharma           NaN        NaN  40000.0  2023-06-12
12         113    Manoj Bhat           1.0      107.0  63000.0  2023-07-25
13         114    Nisha Jain           2.0      108.0  57000.0  2023-08-30
14         115     Omkar Rao           3.0      104.0  75000.0  2023-09-05
15         116     Pooja Sen           4.0      110.0  49000.0  2023-10-10
16         117  Qasim Sheikh           NaN        NaN  42000.0  2023-11-11
17         118  Ritika Ghosh           5.0      106.0  53000.0  2023-12-01
18         119  Sanjay Sinha           1.0      107.0  62000.0  2024-01-01
19         120     Tina Kaur           2.0      102.0  58000.0  2024-02-12
20         121    Uday Bhatt           3.0        NaN  67000.0  2024-03-15